Revit 2027 API
SpecTypeId.Moment Property
 Moment, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Moment { get; }
Public Shared ReadOnly Property Moment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Moment {
	ForgeTypeId^ get ();
}
static member Moment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace